# Базовый образ: используем официальный Go образ на базе Alpine Linux для уменьшения размера
FROM golang:1.24-alpine AS builder

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем go.mod и go.sum для управления зависимостями
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем оставшийся исходный код
COPY . .

# Собираем приложение
RUN go build -o main ./cmd/

# Создаем финальный образ. Используем другой базовый образ для уменьшения размера.
FROM alpine:latest

# Устанавливаем рабочую директорию в контейнере
WORKDIR /root/

# Копируем скомпилированное приложение из предыдущего этапа сборки
COPY --from=builder /app/main .

# Указываем команду для запуска приложения
CMD ["./main"]